<?php
use think\facade\Env;
return [

    //用户等级
    'userRole' =>[
        '0' => '村企业',
        '1' => '镇经管办预审',
        '2' => '镇经发办',
        '3' => '农经站',
        '4' => '审计办',
        '5' => '财政所',
        '6' => '镇资产公司',
        '7' => '安全办前置',
        '8' => '经管办',
        '9' => '镇领导',
        '10' => '安全办',
    ],

    //合同类型
    'contract_type' => [
        '0' => '公开招租',
        '1' => '无证新租',
        '2' => '无证续租',
        '3' => '无证续租',
        '4' => '提前终止',
    ],

    //大鱼短信配置
    'smsConfig' => [
        'accessKeyId' => 'LTAIZTtKcAgdcjRf',
        'accessKeySecret' => 'uAhki13aCt2nylZ4k7Y2SMyaDktkNk',
        'sign' => '储陆强', //签名
        'demoId' => 'SMS_176537947'//模板id
    ],

    //提交标书
    'takeTimes' => [
        '0' => '首次提交',
        '1' => '第二次提交',
        '2' => '第三次提交',
        '3' => '第四次提交',
        '4' => '第五次提交',
        '5' => '第六次提交',
        '6' => '第七次提交',
        '7' => '第八次提交',
        '8' => '第九次提交',
        '9' => '第十次提交',
        '10' => '第N次提交',
    ],

    //合同类型
    'contact_type' => [
        '0' => '公开招租',
        '1' => '无证新租',
        '2' => '无证续租',
        '3' => '变更',
        '4' => '提前终止',
    ],

    //合同流程
    'contact_process' => [
      '0' => '常规流程',
      '1' => '简易流程',
    ],

    //投资方式
    'investment_mode' => [
        '0' => '独资',
        '1' => '村级合作',
        '2' => '其他',
    ],

    //楼宇性质
    'nature_of_building' => [
        '0' => '工业',
        '1' => '商业',
    ],

    //终止原因
    'reasons_for_termination' => [
        '0' => '自然到期',
        '1' => '提前终止',
    ],

    //合同类型
    'type_of_contract' => [
        '0' => '租赁合同',
        '1' => '使用协议',
        '2' => '补充协议',
        '3' => '备忘录',
        '4' => '其他',
    ],

    //租赁方式
    'leasing_mode' => [
        '0' => '新租',
        '1' => '续租',
        '2' => '变更',
    ],

    //工商税收落地
    'tax_landing' => [
        '0' => '是',
        '1' => '否',
    ],

    //承租后实际用途
    'actual_use_after_lease' => [
        '0' => '办公',
        '1' => '商业服务',
        '2' => '生产加工',
        '3' => '其他',
    ],

];
